SET NAMES UTF8;
DROP DATABASE IF EXISTS cake;
CREATE DATABASE cake CHARSET=UTF8;
USE cake;
#商品页面表
CREATE TABLE product(
pid INT PRIMARY KEY AUTO_INCREMENT,
pic_md VARCHAR(200) NOT NULL DEFAULT '',
pic_lg VARCHAR(200) NOT NULL DEFAULT '',
pic_sm VARCHAR(200) NOT NULL DEFAULT '',
pname VARCHAR(50) NOT NULL DEFAULT '',
price DOUBLE(10,2) not null DEFAULT 0,
evalStar VARCHAR(200) NOT NULL DEFAULT '',
category VARCHAR(500) NOT NULL DEFAULT '',
retain VARCHAR(500) NOT NULL DEFAULT '',
discribe VARCHAR(500) NOT NULL DEFAULT ''
);
#商品详情
INSERT INTO product VALUES
(1,'201692615232667713.jpg','201692615232667713.jpg','201692615233959832.jpg','1.黑森林 Black Forest',168.00,'甜度:★★★★☆☆','蛋糕类别:水果蛋糕 巧克力蛋糕 乳脂蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:巧克力(比利時)、乳脂奶油(新西兰)、黑车厘子(美国)、樱桃白兰地(荷兰)、砂糖(韩国)'),
(NULL,'20174189232140847.jpg','20174189232140847.jpg','20174189222031392.jpg','2.心愿 My wish cake',188.00,'甜度:★★★★☆☆','蛋糕类别:水果蛋糕 乳脂蛋糕','保鲜条件：0－4℃保藏12小时，5℃最佳食用','原材料:奶油(新西兰)、奶酪(法国)、车厘子(美国)、芒果(澳洲)、红心火龙果、薄荷叶'),
(NULL,'201692615104933820.jpg','201692615104933820.jpg','201692615351128783.jpg','3.芒果拿破仑 Mango Napoleon',188.00,'甜度:★★★☆☆☆','蛋糕类别:水果蛋糕 乳脂蛋糕','保鲜条件：0－4℃保藏4小时，5℃最佳食用','原材料:奶油(新西兰)、黄油(法国)、卡仕达酱(马达加斯加)、蓝莓(智利)、蓝莓酱(智利)..'),
(NULL,'20171141715178956.jpg','20171141715178956.jpg','20171141772687442.jpg','4.红丝绒 Red velvet',228.00,'甜度:★★★★☆☆','蛋糕类别:乳脂蛋糕 芝士蛋糕','保鲜条件：0－4℃保藏12小时，5℃最佳食用','原材料：新西兰乳脂奶油、法国可可粉、美国蔓越莓、新西兰奶油奶酪'),
(NULL,'201692615335711011.jpg','2016926153357110112.jpg','201692615292249152.jpg','5.黑白慕斯 Dark and White Chocolate',168.00,'甜度:★★★★☆☆','蛋糕类别:慕斯蛋糕 巧克力蛋糕','保鲜条件：0－4℃保藏12小时，5℃最佳食用','原材料：白巧克力(比利時)、乳脂奶油(新西兰)、黑巧克力(比利时)、可可粉(法国)、君度酒(法国)'),
(NULL,'20169261530899498.jpg','20169261530899498.jpg','20174189263885711.jpg','6.百利甜情人 Bailey Lover',168.00,'甜度:★★★★☆☆','蛋糕类别:水果蛋糕 乳脂蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:乳脂奶油(新西兰)、百利甜酒(爱尔兰)、玫瑰汁(云南)、黄油(新西兰)、有机草莓(或黄桃)'),
(NULL,'201711417155388981.jpg','2017114171553889811.jpg','201711417105023427.jpg','7.朗姆CHEESE Rum Cheese',168.00,'甜度:★★☆☆☆☆','蛋糕类别:乳脂蛋糕 芝士蛋糕','保鲜条件：0－4℃保藏12小时，5℃最佳食用','原材料：乳脂奶油(新西兰)、芝士(新西兰)、朗姆酒、柠檬(美国)、砂糖(韩国)'),
(NULL,'201692615212053756.jpg','201692615212053756.jpg','201692615214045636.jpg','8.提拉米苏 Tirmisu',199.00,'甜度:★★★★☆☆','蛋糕类别:慕斯蛋糕','保鲜条件：0－4℃保藏12小时，5℃最佳食用','原材料：Mascarpone、奶酪(新西兰)、咖啡酒(墨西哥)、咖啡(肯尼亚)、可可粉(法国)'),
(NULL,'201692615283040331.jpg','2016926152830403312.jpg','201692615284955141.jpg','9.栗蓉醇香 Chestnut Cream',168.00,'甜度:★★★☆☆☆','蛋糕类别:乳脂蛋糕','保鲜条件：0－4℃保藏12小时，15℃最佳食用','原材料:板栗(中国)、乳脂奶油(新西兰)、黄油(比利时)、砂糖(韩国)'),
(NULL,'20176916142229444.jpg','20176916142229444.jpg','201692615164066911.jpg','10.榴芒 DURIAN & MANGO',199.00,'甜度:★★★☆','蛋糕类别:水果蛋糕 慕斯蛋糕','保鲜条件：0－4℃保藏12小时，5℃最佳食用','原材料:榴莲(泰国)、芒果(澳洲及台湾)、巧克力(比利时)、新西兰奶油、砂糖(韩国)'),
(NULL,'201692615203598060.jpg','201692615203598060.jpg','201692615394961982.jpg','11.澳洲芒果 Mango Mousse',188.00,'甜度:★★★☆☆☆','蛋糕类别:水果蛋糕 慕斯蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:芒果(澳洲、中国台湾)、乳脂奶油(新西兰)、白巧克力(比利时)'),
(NULL,'201692615323423584.jpg','201692615323423584.jpg','201692615264273416.jpg','12.蓝莓香脆 Blueberry Chips',188.00,'甜度:★★☆☆☆☆','蛋糕类别:水果蛋糕 乳脂蛋糕 芝士蛋糕','保鲜条件：0－4℃保藏12小时，5℃最佳食用','原材料:蓝莓鲜果、北美蓝莓果自制的蓝莓酱、乳脂蛋糕奶油(法国)、芝士(新西兰)'),
(NULL,'201711417125332225.jpg','201711417125332225.jpg','201711417131617338.jpg','13.福果 FUGUO',188.00,'甜度:★★★☆☆☆','蛋糕类别:水果蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:奶油(新西兰)、奶酪(法国)、蔓越橘干(美国)、覆盆子(法国)'),
(NULL,'20174189281486750.jpg','20174189281486750.jpg','20174189295126605.jpg','14.福瑞 Fresh Fruit',168.00,'甜度:★★★☆☆☆','蛋糕类别:水果蛋糕 乳脂蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:奶油(新西兰)、奶酪(法国)、蔓越橘干(美国)、覆盆子(法国)、白巧克力(比利时)'),
(NULL,'201692615185886085.jpg','201692615185886085.jpg','201692615191912526.jpg','15.棒子巧克力 Hazenlnut Affair',188.00,'甜度:★★★☆☆☆','蛋糕类别:水果蛋糕 慕斯蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:芒果(澳洲、中国台湾)、乳脂奶油(新西兰)、白巧克力(比利时)'),
(NULL,'201692615222772739.jpg','201692615222772739.jpg','201692615224114363.jpg','16.黑格 Haig',188.00,'甜度:★★★☆☆☆','蛋糕类别:水果蛋糕 慕斯蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:芒果(澳洲、中国台湾)、乳脂奶油(新西兰)、白巧克力(比利时)'),
(NULL,'201692615174110995.jpg','201692615272410509.jpg','201692615271725609.jpg','17.卡布奇诺 Cappuccino Cake',188.00,'甜度:★★★☆☆☆','蛋糕类别:水果蛋糕 慕斯蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:芒果(澳洲、中国台湾)、乳脂奶油(新西兰)、白巧克力(比利时)'),
(NULL,'201692615215639451.jpg','201692615215639451.jpg','201692615221127130.jpg','18.杏仁淡奶 Almond Cream',199.00,'甜度:★★★☆☆☆','蛋糕类别:水果蛋糕 慕斯蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:芒果(澳洲、中国台湾)、乳脂奶油(新西兰)、白巧克力(比利时)'),
(NULL,'20174151628170070.jpg','20174151628170070.jpg','201741516282663428.jpg','19.抹茶雪域 Maccha snows',188.00,'甜度:★★★☆☆☆','蛋糕类别:慕斯蛋糕','保鲜条件：0－4℃保藏12小时，5℃最佳食用','原材料:抹茶粉(日本)、乳脂奶油(新西兰)、巧克力(比利时)、香草(马达加斯加)'),
(NULL,'201741516265450459.jpg','2017415162654504591.jpg','201692615281855767.jpg','20.可瑞斯 Crisp',168.00,'甜度:★★★☆☆☆','蛋糕类别:水果蛋糕 慕斯蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:芝士(新西兰)、乳脂奶油(新西兰)、黄油(新西兰)、白核桃(云南)'),
(NULL,'201692615182349963.jpg','201692615182349963.jpg','201692615184122595.jpg','21.芝士斯诺 Cheese Snow Cake',168.00,'甜度:★★★★☆☆','蛋糕类别:乳脂蛋糕 芝士蛋糕','保鲜条件：0－4℃保藏12小时，5℃最佳食用','原材料:芝士(新西兰)、乳脂奶油(新西兰)、白巧克力(比利时)、黄油(比利时)'),
(NULL,'20169261526338553.jpg','20169261526338553.jpg','201692615261679530.jpg','22.榴莲暗香 Durian',199.00,'甜度:★★★☆☆☆','蛋糕类别:水果蛋糕 巧克力蛋糕 乳脂蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:榴莲(泰国金枕头)、乳脂奶油(新西兰)、白巧克力(比利时)'),
(NULL,'201692615303599784.jpg','2016926153035997842.jpg','201692615305255921.jpg','23.核桃雪域 Hickory Snow',188.00,'甜度:★★★☆☆☆','蛋糕类别:水果蛋糕 坚果蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:白核桃(云南)、乳脂奶油(新西兰)、黄油(比利时)、砂糖(韩国)'),
(NULL,'20169261524093181.jpg','20169261524093181.jpg','201692615241277745.jpg','24.布朗尼 Brownie Cake',168.00,'甜度:★★★☆☆☆','蛋糕类别:巧克力蛋糕 乳汁蛋糕 坚果蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:黑巧克力(比利时)、乳脂奶油(新西兰)、朗姆酒(牙买加)、开心果(美国)、棒子(美国)'),
(NULL,'201692615123991904.jpg','201692615242867006.jpg','201692615244292626.jpg','25.松子仁 Pine Nut Cake',188.00,'甜度:★★☆☆☆☆','蛋糕类别:乳脂蛋糕 坚果蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:松子(俄罗斯)、乳脂奶油(新西兰)、白巧克力(比利时)、砂糖(韩国)'),
(NULL,'201692615253923006.jpg','201692615253923006.jpg','201692615255012124.jpg','26.心语 Heart Talk',168.00,'甜度:★★★☆☆☆','蛋糕类别:巧克力蛋糕 乳脂蛋糕','保鲜条件：0－4℃保藏12小时，15℃最佳食用','原材料:黄油(新西兰)、乳脂奶油(新西兰)、白巧克力(比利时)'),
(NULL,'201692615272410509.jpg','201692615174110995.jpg','20169261518525733.jpg','27.卡布奇诺(无糖)',188.00,'甜度:★★★☆☆☆','蛋糕类别:无糖蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:咖啡粉(哥伦比亚)、乳脂奶油(新西兰)、芝士(新西兰)、咖啡酒(墨西哥)、咖啡豆(肯尼亚)'),
(NULL,'201692615242867006.jpg','201692615123991904.jpg','201692615421172640.jpg','28.松子仁(无糖) Pine Nut Cake',168.00,'甜度:★★★☆☆☆','蛋糕类别:无糖蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:松子(俄罗斯)、乳脂奶油(新西兰)、可可粉(法国)、木糖醇'),
(NULL,'20175281445581247.jpg','20175281445581247.jpg','20165269212716436.jpg','29.童趣 Childhood',168.00,'甜度:★★★☆☆☆','蛋糕类别:水果蛋糕 乳脂蛋糕','保鲜条件：0－4℃保藏12小时，5℃最佳食用','原材料:砂糖(韩国)、乳脂奶油(新西兰)、棉花糖、巧克力豆(比利时)'),
(NULL,'201752817513312413.jpg','201752817513312413.jpg','20175301364991687.jpg','30.Miss喵 Miss Miao',188.00,'甜度:★★★☆☆☆','蛋糕类别:水果蛋糕 慕斯蛋糕 巧克力蛋糕','保鲜条件：0－4℃保藏12小时，5℃最佳食用','原材料:砂糖(韩国)、乳脂奶油(新西兰)、白巧克力(比利时)'),
(NULL,'201752711213534210.jpg','201752711213534210.jpg','201753013113038727.jpg','31.童真 Childlike',228.00,'甜度:★★★☆☆☆','蛋糕类别:水果蛋糕 巧克力蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:砂糖(韩国)、乳脂奶油(新西兰)、巧克力(比利时)、巧克力豆'),
(NULL,'2017541125927855.jpg','2017541125927855.jpg','20175417493977275.jpg','32.甜蜜年轮 Baumkuchen',268.00,'甜度:★★★★☆☆','蛋糕类别:水果蛋糕 乳脂蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:樱桃(美国)、乳脂奶油(新西兰)、覆盆子果酱、桑葚'),
(NULL,'201711417121499501.jpg','201711417121499501.jpg','20171141713949528.jpg','33.莓之恋 Lover of Strawberry',188.00,'甜度:★★★★☆☆','蛋糕类别:水果蛋糕 乳脂蛋糕','保鲜条件：0－4℃保藏12小时，5℃最佳食用','原材料:新鲜有机草莓、乳脂奶油(新西兰)'),
(NULL,'201612917403147835.jpg','201612917403147835.jpg','201612917464162497.jpg','34.草莓轻芝士 Strawberry Cheesecake',268.00,'甜度:★★★★☆☆','蛋糕类别:水果蛋糕 芝士蛋糕 乳脂蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:有机新鲜草莓、乳脂奶油(新西兰)、坚果酥底、芝士(新西兰)'),
(NULL,'201612917392180041.jpg','201612917392180041.jpg','201612917453832639.jpg','35.草莓拿破仑 Strawberry Napoleon',188.00,'甜度:★★★☆☆☆','蛋糕类别:水果蛋糕 乳脂蛋糕','保鲜条件：0－4℃保藏12小时，10℃最佳食用','原材料:新鲜有机草莓、手工酥皮、乳脂奶油(新西兰)、黄油、奶油');

#用户表
CREATE TABLE t_user(
uid INT PRIMARY KEY AUTO_INCREMENT,
uname VARCHAR(20) NOT NULL DEFAULT '',
email VARCHAR(50) NOT NULL DEFAULT '',
upwd VARCHAR(32) NOT NULL DEFAULT '',
phone BIGINT
);
INSERT INTO t_user VALUES
(1,'tony','tony@163.com','123456',13578263781),
(NULL,'mary','mary@qq.com','123456',13578263781),
(NULL,'james','james@163.com','123456',13578263781);
#购物车表
CREATE TABLE t_cart(
cid INT PRIMARY KEY AUTO_INCREMENT,
uid INT NOT NULL DEFAULT 0,
pid INT NOT NULL DEFAULT 0,
count INT NOT NULL DEFAULT 0
);
INSERT INTO t_cart VALUES
(NULL,1,1,2),
(NULL,1,2,1);
#订单页面表
CREATE TABLE t_order(
oid BIGINT PRIMARY KEY AUTO_INCREMENT,
conName VARCHAR(32),
phoneNum VARCHAR(20),
price DECIMAL(10,2),
payment TINYINT,
orderTime DATETIME NOT NULL DEFAULT 0,
userId INT
);
INSERT INTO t_order VALUES
(913432801,'jackson','13523435435',168,1,'2016-06-08 13:00:13', 1),
(null,'mary','13545525555',1200, 2, '2016-07-12 19:00:00', 1),
(null,'jackson','13545525555',1200, 3, '2016-07-18 18:30:43', 1),
(null,'james','13545525555',1200, 1, '2016-12-15 14:00:00', 1),
(null,'bluce','13545525555',1200, 4, '2017-01-01 09:00:12', 1),
(null,'chancel','13545525555',1200, 2, '2017-02-08 11:00:16', 1);
CREATE TABLE t_order_detail(
  did INT PRIMARY KEY AUTO_INCREMENT,
  orderId BIGINT,
  productId INT,
  count INT
);
INSERT INTO t_order_detail VALUES
  (NULL, 913432801, 10, 1),
  (NULL, 913432801, 15, 3),
  (NULL, 913432802, 3, 2),
  (NULL, 913432803, 5, 1),
  (NULL, 913432803, 7, 2),
  (NULL, 913432803, 13, 4),
  (NULL, 913432804, 22, 2),
  (NULL, 913432804, 15, 3),
  (NULL, 913432805, 9, 1),
  (NULL, 913432806, 31, 2),
  (NULL, 913432806, 32, 1),
  (NULL, 913432807, 18, 1);